package ru.dad.task2_1;

import java.util.Scanner;

/*
6. Азбука Морзе
На вход подается строка S, состоящая только из русских заглавных букв (без Ё).

Необходимо реализовать метод, который кодирует переданную строку с помощью азбуки Морзе и затем
вывести результат на экран. Отделять коды букв нужно пробелом.

Для удобства представлен массив с кодами Морзе ниже:
{".-", "-...", ".--", "--.", "-..", ".", "...-", "--..", "..", ".---", "-.-", ".-..", "--", "-.", "---", ".--.", ".-.", "...", "-", "..-", "..-.", "....", "-.-.", "---.", "----", "--.-", "--.--", "-.--", "-..-", "..-..", "..--", ".-.-"}


Ограничение:
0 < S.length() < 1000

Примечание:
Решение должно находиться в файле с названием Solution.java.
Публичный класс с решением должен называться Solution.
Использовать package нельзя.

Пример входных данных
ПРИВЕТ

Пример выходных данных
.--. .-. .. .-- . -

 */
public class Solution6 {
    static String[] arrCode = {".-", "-...", ".--", "--.", "-..", ".", "...-", "--..", "..", ".---", "-.-",
            ".-..", "--", "-.", "---", ".--.", ".-.", "...", "-", "..-", "..-.", "....", "-.-.", "---.",
            "----", "--.-", "--.--", "-.--", "-..-", "..-..", "..--", ".-.-"};

    static char[] arr = {'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р',
            'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я'};

    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        String s = scanner.nextLine();

        encodesLine(s);
    }

    public static void encodesLine(String s) {
        char[] s1 = s.toCharArray();
        for (int i = 0; i < s1.length; i++) {
            for (int j = 0; j < arr.length; j++) {
                if (s1[i] == arr[j]) {
                    for (int k = 0; k < arrCode.length; k++) {
                        if (k == j) {
                            System.out.print(arrCode[k] + " ");
                        }
                    }
                }
            }
        }
    }
}
